{
  "backend/main.mo": "Main Motoko actor implementing an e-commerce backend with product, order, cart, and user profile management, including authorization mixins and access control for admin and user operations.",
  "feature_evidence.json": "Feature evidence report documenting the implementation of an informational section on the admin products page that explains the product upload workflow.",
  "frontend-file-summaries.txt": "JSON summary of all frontend files describing components, pages, hooks, and styling for the e-commerce application with admin functionality and user authentication.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining design tokens for light and dark themes using warm earth tones.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for product catalog, checkout, order confirmation, and admin pages with theme provider and toast notifications.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that verifies user authentication and admin privileges, displaying appropriate error messages and redirects for unauthorized access.",
  "frontend/src/components/Cart.tsx": "Shopping cart component displaying cart items with images, prices, total calculation, and actions for checkout and clearing the cart.",
  "frontend/src/components/CartButton.tsx": "Header cart button with item count badge that opens a sheet panel containing the full cart component.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with sticky header navigation, conditional admin links, cart button, login button, user profile setup modal, and footer with attribution.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login/logout with loading states, using the useInternetIdentity hook and clearing the query cache on logout.",
  "frontend/src/components/UserProfileSetup.tsx": "A modal dialog that prompts authenticated users without a profile to enter their name, blocking interaction until profile setup is complete.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance with authentication, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality, managing identity state and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including products, cart, orders, and user profiles with automatic cache invalidation on mutations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-toned color scheme for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers wrapping the main App component.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all customer orders in expandable cards with product details, images, and total prices, showing empty state when no orders exist.",
  "frontend/src/pages/AdminProducts.tsx": "Admin page for managing products with CRUD operations (add, edit, delete) including form handling for product details, image uploads, and validation with toast notifications.",
  "frontend/src/pages/Checkout.tsx": "Checkout page that displays cart items, collects shipping information via form, validates input, and processes orders with navigation to order confirmation.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays order details, purchased items with images, and total price after successful checkout.",
  "frontend/src/pages/ProductCatalog.tsx": "Product catalog page with hero banner that displays all products in a grid layout and allows authenticated users to add items to cart.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and sessionStorage, supporting both regular and hash-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, animations, and typography plugins.",
  "project_state.json": "Project state file for an e-commerce website called 'Business Store' with 7 completed features including product catalog, shopping cart, checkout, admin interface with Internet Identity auth, and professional design theme. Contains one pending feature request for creating the e-commerce website foundation."
}