{
  "backend/main.mo": "Main Motoko actor defining Product, Order, Cart, and UserProfile modules with CRUD operations for products, orders, carts, and user profiles, including authorization checks via MixinAuthorization and blob storage via MixinStorage.",
  "feature_evidence.json": "Feature evidence report documenting four implemented features related to the My Account page: creating the /account route with order history, adding navigation link for authenticated users, enabling order detail navigation, and displaying empty state messages.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including components, pages, hooks, and configuration files with descriptions of their functionality and styling.",
  "frontend/index.css": "Global CSS with Tailwind directives defining OKLCH color system variables for light and dark modes, including primary, secondary, muted, accent, destructive, border, and chart colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, title \"OM FANCY\", root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for product catalog, checkout, order confirmation, order details, My Account, and admin pages (products/orders) with AdminGuard protection, wrapped in ThemeProvider and Toaster.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks authentication and admin status using useInternetIdentity and useIsAdmin hooks, displaying loading states, authentication required message, or access denied message for non-admin users.",
  "frontend/src/components/Cart.tsx": "Shopping cart panel component displaying cart items with images, descriptions, prices, total calculation, clear cart button, and checkout navigation, with empty state UI when cart is empty.",
  "frontend/src/components/CartButton.tsx": "Button component with shopping cart icon and item count badge that opens a Sheet drawer containing the Cart component when clicked.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing navigation links (Products, My Account, Admin sections), logo, cart button, and login button. Conditionally renders navigation items based on authentication status and admin role.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that uses Internet Identity for authentication. Handles login, logout, and displays loading state with appropriate icons.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Automatically shows after login if user profile doesn't exist and blocks interaction until completed.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state. Handles actor initialization with identity, admin token setup, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication. Manages login state, identity persistence, and provides login/logout functions with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including products (get, add, update, delete), cart (get, add, clear), checkout, orders (get all, get user orders), and user profile management.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space. Defines design tokens for backgrounds, foregrounds, borders, and chart colors with modern vibrant styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component into the DOM root.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page that displays all customer orders in an accordion layout, showing order details including customer address, products with images, quantities, and total prices.",
  "frontend/src/pages/AdminProducts.tsx": "Admin product management page with CRUD operations for products, including forms for adding/editing products with name, description, price, and image upload functionality.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a shipping information form and order summary, validating user input and processing orders through the checkout mutation before redirecting to order confirmation.",
  "frontend/src/pages/MyAccount.tsx": "Customer account page displaying user's order history sorted by most recent first, with each order showing total price and linking to detailed order views.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page that displays order details after successful checkout, showing ordered items with images, prices, and total amount with a success message.",
  "frontend/src/pages/OrderDetails.tsx": "Displays detailed information for a single order including customer info, order items with images and prices, and order summary with total amount.",
  "frontend/src/pages/ProductCatalog.tsx": "Renders the main product catalog page with a hero banner and grid of products, allowing authenticated users to add items to cart.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH, animations, shadows, and typography settings for the application theme.",
  "project_state.json": "Project metadata tracking implemented features for customer account management and order history viewing, with one pending feature request for a 'My Account' section."
}