{
  "backend/main.mo": "Main Motoko actor defining Product, Order, and Cart modules with user profile management, customer details storage, product/order CRUD operations, and admin-only functions for managing products and orders.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: admin CSV export page for customer order data and navigation link addition to the admin section header.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including styling, routing, hooks, components, and pages with details about the vibrant blue-cyan design system, admin features, and order management functionality.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including primary, secondary, muted, accent, destructive, and sidebar color variables.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, \"OM FANCY\" title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for product catalog, checkout, order pages, My Account, and admin pages (products, orders, export data) wrapped in ThemeProvider and Layout with AdminGuard protection.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks authentication and admin status, displaying loading spinner during initialization or access denied messages for unauthenticated/unauthorized users.",
  "frontend/src/components/Cart.tsx": "Shopping cart panel displaying cart items with images, prices, total calculation, clear cart button, and checkout navigation with gradient styling and empty state handling.",
  "frontend/src/components/CartButton.tsx": "Cart button component with item count badge that opens a sheet/drawer containing the Cart component, featuring gradient badge styling and hover effects.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation (Products, My Account, Admin sections), branding, and conditional rendering based on authentication and admin status.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login and logout states, handles Internet Identity authentication flow, and clears query cache on logout.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, blocking interaction until profile setup is complete.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state, initializes access control with admin token, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, delegation validation, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including products (get, add, update, delete), cart (get, add, clear), checkout, orders (get all, get user's, get by ID), user profiles, and admin functions.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes using OKLCH color space, defining colors for backgrounds, foregrounds, borders, and chart elements with modern vibrant styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminExportData.tsx": "Admin page for exporting all customer order data to CSV, including customer details, products, quantities, prices, and payment methods. Uses custom CSV export utilities and displays order count and file format information.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all customer orders in an accordion layout with order details, customer principal, payment method, and product information. Shows order totals and allows expanding each order to view full details.",
  "frontend/src/pages/AdminProducts.tsx": "Admin product management page with CRUD operations for products including name, description, price, and image upload. Features add/edit dialogs, delete confirmation, and image validation with 5MB size limit.",
  "frontend/src/pages/Checkout.tsx": "Customer checkout page with shipping form, payment method selection (cash on delivery, credit card, UPI), and order summary. Validates form inputs and processes checkout through the backend mutation.",
  "frontend/src/pages/MyAccount.tsx": "Customer account page displaying order history sorted by most recent first. Shows order cards with ID, date, total, and product previews, with navigation to detailed order views.",
  "frontend/src/pages/OrderConfirmation.tsx": "Displays order confirmation page after purchase with order details, product list, payment method, and total amount using TanStack Router and custom hooks.",
  "frontend/src/pages/OrderDetails.tsx": "Shows detailed order information including customer details, payment method, and ordered products with navigation back to store.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page with hero banner and product grid, allowing authenticated users to add items to cart.",
  "frontend/src/utils/csvExport.ts": "Utility functions for CSV generation including field escaping, array-to-CSV conversion, file download triggering, and timestamped filename generation.",
  "frontend/src/utils/urlParams.ts": "URL parameter parsing utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH, extended animations, shadows, and typography plugins for the fashion store UI.",
  "project_state.json": "Project state tracking document showing pending feature requests for customer data export functionality and admin page creation."
}