{
  "backend/main.mo": "Main Motoko actor implementing an e-commerce backend with authorization and blob storage mixins, managing products, orders, carts, and user profiles with role-based access control for admin and user operations.",
  "feature_evidence.json": "Feature evidence report documenting two completed high-confidence features: updating the HTML page title and Layout component branding from 'Business Store' to 'OM FANCY'.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing a modern e-commerce UI with vibrant blue-cyan gradient design, Space Grotesk typography, React components for shopping cart, checkout, admin panels, and 'OM FANCY' branding.",
  "frontend/index.css": "Tailwind CSS base styles defining OKLCH color system CSS variables for light and dark themes with neutral grayscale palette and chart colors.",
  "frontend/index.html": "HTML entry point with page title set to 'OM FANCY' and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app component configuring TanStack Router with routes for product catalog, checkout, order confirmation, and admin pages (products/orders) with AdminGuard protection and ThemeProvider wrapper.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks authentication and admin status, displaying loading states or access denied messages for unauthorized users before rendering protected admin content.",
  "frontend/src/components/Cart.tsx": "Shopping cart panel component displaying cart items with images, prices, total calculation, gradient styling, and buttons for clearing cart and proceeding to checkout.",
  "frontend/src/components/CartButton.tsx": "Button component with shopping cart icon and badge showing item count, triggering a Sheet drawer that displays the Cart component.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header containing logo, navigation links (Products, Manage Products, Orders for admins), cart button, and login button. Includes footer with copyright and Caffeine.ai attribution.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login and logout states, handles Internet Identity authentication flow, and clears query cache on logout.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name on first login, blocking interaction until profile setup is complete.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state, initializing access control with admin token and invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity persistence in local storage, and authentication status states.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including products (get, add, update, delete), cart (get, add, clear), orders (get, checkout), user profiles, and admin checks with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light and dark themes using OKLCH color space, defining colors for backgrounds, foregrounds, borders, and chart elements with modern vibrant styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page displaying all customer orders in an accordion layout with order details, customer information, and product items with images and pricing.",
  "frontend/src/pages/AdminProducts.tsx": "Admin product management page with CRUD operations including add, edit, and delete dialogs, image upload handling, and price validation in cents.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with shipping information form, cart summary, and order submission that navigates to order confirmation upon successful checkout.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page displaying order details, purchased items with images, and total price after successful checkout.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page with hero banner and product grid, allowing authenticated users to add items to cart with loading states and toast notifications.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes using OKLCH color space, extended animations, shadows, and typography settings with Space Grotesk as the primary font.",
  "project_state.json": "Project state tracking file showing completed features to rebrand from 'Business Store' to 'OM FANCY' in the HTML title and layout header."
}