{
  "backend/main.mo": "Main Motoko actor implementing an e-commerce backend with authorization and blob storage mixins, managing products, orders, carts, and user profiles with role-based access control for admin and user operations.",
  "feature_evidence.json": "Feature evidence report documenting a single feature change to update the ProductCatalog hero section tagline from 'DISCOVER PREMIUM TECHNOLOGY' to 'MAKE YOUR OWN CHOICE WITH PREMIUM OUTFIT'.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files describing the UI implementation with vibrant blue-cyan theming, product catalog, checkout flow, admin pages, and various React components.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes including primary, secondary, muted, accent, destructive, and sidebar color variables.",
  "frontend/index.html": "HTML entry point for the React application with 'OM FANCY' title and root div mounting point.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with routes for product catalog, checkout, order pages, account management, and admin sections with theme provider and toast notifications.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks authentication and admin status, displaying appropriate access denied messages with loading states for unauthorized users.",
  "frontend/src/components/Cart.tsx": "Shopping cart panel component displaying cart items with images, prices, total calculation, clear cart functionality, and checkout navigation with gradient styling and empty state handling.",
  "frontend/src/components/CartButton.tsx": "Shopping cart button with item count badge that opens a sheet panel containing the Cart component, featuring gradient badge styling and hover effects.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation links (Products, My Account, Admin sections), and renders child content. Conditionally displays navigation items based on authentication status and admin role.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component that handles Internet Identity authentication, displays loading state during login, and clears query cache on logout.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name. Prevents dismissal until profile is created.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state, initializes access control with admin token, and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, and AuthClient lifecycle with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for products, cart, orders, and user profile operations. Includes queries for fetching data and mutations for adding/updating/deleting with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors using OKLCH color space, plus base typography styles using Space Grotesk and Inter fonts.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page that displays all customer orders in an accordion layout, showing order details including customer info, payment method, products, and total price.",
  "frontend/src/pages/AdminProducts.tsx": "Admin page for managing products with CRUD operations (add, edit, delete) including image upload, form validation, and product listing display.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with customer information form, payment method selection (cash on delivery, credit card, crypto), cart summary, and order submission functionality.",
  "frontend/src/pages/MyAccount.tsx": "Customer account page displaying user's order history sorted by most recent, with navigation to individual order details.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page shown after successful checkout, displaying order details including items, payment method, and total with a success message.",
  "frontend/src/pages/OrderDetails.tsx": "Displays detailed order information including customer details, payment method, and order items with images and pricing. Uses React Router for navigation and displays loading/error states.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page with hero banner showing 'OM FANCY & GIFT COLLECTION' branding and tagline 'Make your own choice with premium outfit'. Displays product grid with add-to-cart functionality requiring authentication.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom OKLCH color system, extended animations, Space Grotesk font, and custom shadows/border-radius utilities.",
  "project_state.json": "Project metadata tracking the e-commerce store for 'OM FANCY & GIFT COLLECTION' with completed feature to update hero tagline to 'MAKE YOUR OWN CHOICE WITH PREMIUM OUTFIT'."
}