{
  "backend/main.mo": "Main Motoko actor implementing an e-commerce backend with product, order, cart, and user profile management, including authorization mixins and blob storage for images.",
  "feature_evidence.json": "Feature evidence report documenting the change of welcome text from 'WELCOME TO BUSINESS STORE' to 'WELCOME TO OM FANCY & GIFT COLLECTION' in ProductCatalog.tsx.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files describing UI components, pages, hooks, and styling with vibrant blue-cyan theme and 'OM FANCY' branding throughout.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS custom properties for light and dark themes with neutral grayscale values.",
  "frontend/index.html": "HTML entry point with page title set to 'OM FANCY' and root div for React mounting.",
  "frontend/src/App.tsx": "Main React app with TanStack Router setup defining routes for product catalog, checkout, order pages, account management, and admin pages with guards.",
  "frontend/src/components/AdminGuard.tsx": "Route guard component that checks authentication and admin status, displaying appropriate access denied messages for unauthorized users.",
  "frontend/src/components/Cart.tsx": "Shopping cart panel displaying cart items with images, prices, total calculation, and buttons for clearing cart and proceeding to checkout.",
  "frontend/src/components/CartButton.tsx": "Shopping cart button with item count badge that opens a sheet panel containing the Cart component.",
  "frontend/src/components/Layout.tsx": "Main layout component with sticky header, navigation links (Products, My Account, Admin sections), and conditional rendering based on authentication and admin status. Includes branding, cart button, login button, and user profile setup modal.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login and logout states, handles Internet Identity authentication flow, and clears the query cache on logout.",
  "frontend/src/components/UserProfileSetup.tsx": "Modal dialog that prompts authenticated users without a profile to enter their name, blocking interaction until profile setup is complete.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on authentication state, initializes access control with admin token from URL params, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flow, identity state, delegation validation, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for all backend operations including product queries, cart management, checkout, order retrieval, and admin mutations (add/update/delete products, update order status, user profile operations).",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a modern vibrant color theme for both light and dark modes, including primary, secondary, accent, and chart colors using OKLCH color space.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClientProvider for React Query and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/AdminOrders.tsx": "Admin page that displays all customer orders in an accordion layout, showing order details including customer info, payment method, products, and total price.",
  "frontend/src/pages/AdminProducts.tsx": "Admin page for managing products with CRUD operations (add, edit, delete) including image upload, form validation, and product listing with cards.",
  "frontend/src/pages/Checkout.tsx": "Checkout page with a form for customer details, payment method selection (radio group), cart summary, and order submission functionality.",
  "frontend/src/pages/MyAccount.tsx": "Customer account page displaying user's order history sorted by most recent, with navigation to individual order details.",
  "frontend/src/pages/OrderConfirmation.tsx": "Order confirmation page shown after successful checkout, displaying order details, purchased items, payment method, and total amount.",
  "frontend/src/pages/OrderDetails.tsx": "Displays detailed order information including customer details, payment method, and order items with product images and prices. Fetches order data and user profile, handles loading and error states, and provides navigation back to the store.",
  "frontend/src/pages/ProductCatalog.tsx": "Main product catalog page with a hero banner featuring 'OM FANCY & GIFT COLLECTION' branding and a grid of products. Handles adding products to cart with authentication checks and loading states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting and managing URL parameters from both regular query strings and hash-based routing, with sessionStorage persistence support. Includes functions to get, store, clear, and persist parameters across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, container settings, custom shadows, animations (accordion, fade-in), and Space Grotesk font family.",
  "project_state.json": "Project metadata tracking one completed feature that changed the welcome text to 'OM FANCY & GIFT COLLECTION' in the product catalog hero section. Project is at version 3 with no pending feature requests or known issues."
}